# Pandas

### import library

In [1]:
import pandas as pd # pd is a shortcut for pandas library

In [2]:
from pandas import Series, DataFrame # for importing Series and data frame data structures

In [3]:
A = pd.Series([2,3, -9, 5,3,7,8])

In [4]:
A

0    2
1    3
2   -9
3    5
4    3
5    7
6    8
dtype: int64

In [6]:
A.values

array([ 2,  3, -9,  5,  3,  7,  8], dtype=int64)

In [7]:
A.index

RangeIndex(start=0, stop=7, step=1)

In [9]:
B = pd.Series([3, 2, 9, 21,6,87,98], index=['e', 'f', 'z', 'a','s','h','l'])

In [10]:
B

e     3
f     2
z     9
a    21
s     6
h    87
l    98
dtype: int64

In [11]:
B['s']

6

In [12]:
B[['a', 'f', 'h']]

a    21
f     2
h    87
dtype: int64

In [13]:
B[B > 10]

a    21
h    87
l    98
dtype: int64

In [14]:
B * 2

e      6
f      4
z     18
a     42
s     12
h    174
l    196
dtype: int64

In [16]:
'g' in B

False

In [17]:
'a' in B

True

In [18]:
dict_data = {'delhi': 53000, 'mumbai': 36100, 'jaipur': 63000, 'faridad': 87000}

In [19]:
C = pd.Series(dict_data)

In [20]:
C

delhi      53000
mumbai     36100
jaipur     63000
faridad    87000
dtype: int64

In [21]:
C.isnull()

delhi      False
mumbai     False
jaipur     False
faridad    False
dtype: bool

In [22]:
data = {'state': ['delhi', 'delhi', 'delhi', 'mumbai', 'mumbai', 'mumbai'],
 'year': [2002, 2003, 2004, 2005, 2003, 2002],
 'pop': [2.5, 3.7, 1.6, 3.4, 4.9, 6.2]}

In [23]:
df = pd.DataFrame(data)

In [24]:
df

    state  year  pop
0   delhi  2002  2.5
1   delhi  2003  3.7
2   delhi  2004  1.6
3  mumbai  2005  3.4
4  mumbai  2003  4.9
5  mumbai  2002  6.2

In [26]:
df.head()

    state  year  pop
0   delhi  2002  2.5
1   delhi  2003  3.7
2   delhi  2004  1.6
3  mumbai  2005  3.4
4  mumbai  2003  4.9

In [28]:
df['pop']

0    2.5
1    3.7
2    1.6
3    3.4
4    4.9
5    6.2
Name: pop, dtype: float64

In [29]:
df.year

0    2002
1    2003
2    2004
3    2005
4    2003
5    2002
Name: year, dtype: int64

In [31]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
 ....: index=['one', 'two', 'three', 'four',
 ....: 'five', 'six'])

In [32]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [33]:
frame2

       year   state  pop debt
one    2002   delhi  2.5  NaN
two    2003   delhi  3.7  NaN
three  2004   delhi  1.6  NaN
four   2005  mumbai  3.4  NaN
five   2003  mumbai  4.9  NaN
six    2002  mumbai  6.2  NaN

In [34]:
 frame2['debt'] = val

In [35]:
frame2

       year   state  pop  debt
one    2002   delhi  2.5   NaN
two    2003   delhi  3.7  -1.2
three  2004   delhi  1.6   NaN
four   2005  mumbai  3.4  -1.5
five   2003  mumbai  4.9  -1.7
six    2002  mumbai  6.2   NaN

In [36]:
frame2['northern'] = frame2.state == 'delhi'

In [38]:
del frame2['northern']

In [39]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
 ....: 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [40]:
frame3 = pd.DataFrame(pop)

In [41]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [42]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [44]:
frame2.values

array([[2002, 'delhi', 2.5, nan],
       [2003, 'delhi', 3.7, -1.2],
       [2004, 'delhi', 1.6, nan],
       [2005, 'mumbai', 3.4, -1.5],
       [2003, 'mumbai', 4.9, -1.7],
       [2002, 'mumbai', 6.2, nan]], dtype=object)

In [45]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [46]:
index = obj.index

In [47]:
index

Index(['a', 'b', 'c'], dtype='object')

In [48]:
index[0:2]

Index(['a', 'b'], dtype='object')

In [49]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [50]:
'Ohio' in frame3.columns

True

In [59]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [60]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [61]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [62]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [65]:
new_obj = obj.drop('c')

In [66]:
new_obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [68]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 .....: index=['Ohio', 'Colorado', 'Utah', 'New York'],
 .....: columns=['one', 'two', 'three', 'four'])

NameError: name 'np' is not defined